Revit 2027 API
Checker.CheckerColor1 Property
 The property labeled "Color 1" from the "Checker" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CheckerColor1 { get; }
Public Shared ReadOnly Property CheckerColor1 As String
	Get
public:
static property String^ CheckerColor1 {
	String^ get ();
}
static member CheckerColor1 : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Checker Class
Autodesk.Revit.DB.Visual Namespace